<div style="display:block; margin-bottom:50px">
<h1 style="margin-bottom:25px; margin-top: 25px; font-size:3rem;color:#4c76ce;text-align:center;">
    Praktinis Projektas: Gapminder Duomenų Vizualizacija</h1>
    
<h2 style="margin-bottom: 25px;font-size:2.5rem;text-align:center;color:#8d1c1a;">
    2. Duomenų paruošimas Gapminder vizualizacijai
    </h2>
       
<img src="https://raw.githubusercontent.com/lajmcourses/Images/master/bokeh.png"
     style="position:absolute;top:5px;left:25px;height:150px;width:auto;margin-bottom:35px;">
</div>

In [44]:
import numpy as np
import pandas as pd
import os

## Duomenų importas

In [45]:
# Countries

df_countries = pd.read_csv("cleaned_data/cd_countries.csv")
df_countries.head()

  Country Name Country Code Continent
0  Afghanistan          AFG      Asia
1      Albania          ALB    Europe
2      Algeria          DZA    Africa
3      Andorra          AND    Europe
4       Angola          AGO    Africa

In [46]:
df_countries.shape

(184, 3)

In [47]:
# Fertility

df_fertility = pd.read_csv("cleaned_data/cd_fertility.csv")
df_fertility.head()

,Country Code,Country Name,1960,1961,1962,1963,1964,1965,1966,1967,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,AFG,Afghanistan,7.45,7.45,7.45,7.45,7.45,7.45,7.45,7.45,...,5.77,5.56,5.36,5.16,4.98,4.80,4.63,4.47,4.32,4.18
1,ALB,Albania,6.49,6.40,6.28,6.13,5.96,5.77,5.58,5.39,...,1.67,1.68,1.69,1.69,1.68,1.66,1.64,1.62,1.60,1.58
2,DZA,Algeria,7.52,7.57,7.61,7.65,7.67,7.67,7.68,7.67,...,2.91,2.95,2.99,3.02,3.04,3.05,3.04,3.02,2.99,2.94
3,AND,Andorra,1.24,1.24,1.24,1.24,1.24,1.24,1.24,1.24,...,1.25,1.25,1.25,1.25,1.25,1.25,1.25,1.25,1.25,1.25
4,AGO,Angola,6.71,6.79,6.87,6.95,7.04,7.12,7.19,7.27,...,6.12,6.04,5.95,5.86,5.77,5.69,5.60,5.52,5.44,5.37

In [48]:
df_fertility.shape

(184, 63)

In [49]:
# Life Expectancy

df_life_expectancy = pd.read_csv("cleaned_data/cd_life_expectancy.csv")
df_life_expectancy.head()

,Country Code,Country Name,1960,1961,1962,1963,1964,1965,1966,1967,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,AFG,Afghanistan,32.446,32.962,33.471,33.971,34.463,34.948,35.430,35.914,...,61.553,62.054,62.525,62.966,63.377,63.763,64.130,64.486,64.833,65.17300
1,ALB,Albania,62.283,63.301,64.190,64.914,65.463,65.850,66.110,66.304,...,76.914,77.252,77.554,77.813,78.025,78.194,78.333,78.458,78.573,78.67178
2,DZA,Algeria,46.141,46.599,47.056,47.509,47.958,48.394,48.811,49.210,...,75.199,75.436,75.661,75.878,76.090,76.298,76.499,76.693,76.880,77.06300
3,AND,Andorra,84.500,84.500,84.500,84.500,84.500,84.500,84.500,84.500,...,84.500,84.500,84.500,84.500,84.500,84.500,84.500,84.500,84.500,84.50000
4,AGO,Angola,37.524,37.811,38.113,38.430,38.760,39.102,39.454,39.813,...,56.330,57.236,58.054,58.776,59.398,59.925,60.379,60.782,61.147,61.48700

In [50]:
df_life_expectancy.shape

(184, 63)

In [51]:
# Population

df_population = pd.read_csv("cleaned_data/cd_population.csv")
df_population.head()

,Country Code,Country Name,1960,1961,1962,1963,1964,1965,1966,1967,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,AFG,Afghanistan,8996967,9169406,9351442,9543200,9744772,9956318,10174840,10399936,...,30117411,31161378,32269592,33370804,34413603,35383028,36296111,37171922,38041757,38928341
1,ALB,Albania,1608800,1659800,1711319,1762621,1814135,1864791,1914573,1965598,...,2905195,2900401,2895092,2889104,2880703,2876101,2873457,2866376,2854191,2837743
2,DZA,Algeria,11057864,11336336,11619828,11912800,12221675,12550880,12902626,13275020,...,36661438,37383899,38140135,38923688,39728020,40551398,41389174,42228415,43053054,43851043
3,AND,Andorra,13410,14378,15379,16407,17466,18542,19646,20760,...,83748,82427,80770,79213,77993,77295,76997,77008,77146,77265
4,AGO,Angola,5454938,5531451,5608499,5679409,5734995,5770573,5781305,5774440,...,24220660,25107925,26015786,26941773,27884380,28842482,29816769,30809787,31825299,32866268

In [52]:
df_population.shape

(184, 63)

## Duomenų transformacija: Wide to Long

### Gimstamumas

In [53]:
# Fertility dataframe transformation

year_columns = list(df_fertility.columns[2:])


df_fertility_long = pd.melt(df_fertility, 
                            id_vars=["Country Code", "Country Name"],
                            value_vars=year_columns, 
                            var_name="Year",     
                            value_name="Fertility"
                        )
df_fertility_long.head()

  Country Code Country Name  Year  Fertility
0          AFG  Afghanistan  1960       7.45
1          ALB      Albania  1960       6.49
2          DZA      Algeria  1960       7.52
3          AND      Andorra  1960       1.24
4          AGO       Angola  1960       6.71

### Gyvenimo ilgis

In [54]:
# Life Expectancy dataframe transformation

year_columns = list(df_life_expectancy.columns[2:])


df_life_expectancy_long = pd.melt(df_life_expectancy, 
                            id_vars=["Country Code", "Country Name"],
                            value_vars=year_columns, 
                            var_name="Year",     
                            value_name="Life Expectancy"
                        )
df_life_expectancy_long.head()

  Country Code Country Name  Year  Life Expectancy
0          AFG  Afghanistan  1960           32.446
1          ALB      Albania  1960           62.283
2          DZA      Algeria  1960           46.141
3          AND      Andorra  1960           84.500
4          AGO       Angola  1960           37.524

### Gyventojų skaičius

In [55]:
# Population dataframe transformation

year_columns = list(df_population.columns[2:])


df_population_long = pd.melt(df_population, 
                            id_vars=["Country Code", "Country Name"],
                            value_vars=year_columns, 
                            var_name="Year",     
                            value_name="Population"
                        )
df_population_long.head()

  Country Code Country Name  Year  Population
0          AFG  Afghanistan  1960     8996967
1          ALB      Albania  1960     1608800
2          DZA      Algeria  1960    11057864
3          AND      Andorra  1960       13410
4          AGO       Angola  1960     5454938

## Merging of DataFrames

Mes norime

a) apjungti gimstamumo, gyvenimo ilgio ir gyventojų skaičiaus duomenis į vieną lentelę

**Lentelės stulpeliai:** 
    
    "Country Code", "Country Name", "Year", "Fertility", "Life Expectancy", "Population"

b) Mums taip pat reikia prijungti continento duomenis prie bendrosios lentelės

In [56]:
# Merging of dataframes

df_gapminder = df_fertility_long.merge(df_life_expectancy_long, 
                                       on=["Country Code", "Country Name", "Year"]
                               ).merge(df_population_long,
                                       on=["Country Code", "Country Name", "Year"]     
                               )
df_gapminder

,Country Code,Country Name,Year,Fertility,Life Expectancy,Population
0,AFG,Afghanistan,1960,7.45,32.446,8996967
1,ALB,Albania,1960,6.49,62.283,1608800
2,DZA,Algeria,1960,7.52,46.141,11057864
3,AND,Andorra,1960,1.24,84.500,13410
4,AGO,Angola,1960,6.71,37.524,5454938
...,...,...,...,...,...,...
11219,VEN,"Venezuela, RB",2020,2.23,72.066,28435943
11220,VNM,Vietnam,2020,2.05,75.493,97338583
11221,YEM,"Yemen, Rep.",2020,3.61,66.181,29825968
11222,ZMB,Zambia,2020,4.50,64.194,18383956
11223,ZWE,Zimbabwe,2020,3.46,61.738,14862927

In [57]:
# Attaching Continent

if "Continent" not in df_gapminder.columns:
    df_gapminder = df_countries.merge(df_gapminder, 
                                      on=["Country Name", "Country Code"]
                                     )

## Skritulio dydis Gapminder diagramoje

In [58]:
def circle_size(country_population):
    s = np.sqrt(country_population) / 250 
    return max(round(s,0), 5)

df_gapminder["Circle Size"] = df_gapminder["Population"].apply(circle_size)

df_gapminder.head()

,Country Name,Country Code,Continent,Year,Fertility,Life Expectancy,Population,Circle Size
0,Afghanistan,AFG,Asia,1960,7.45,32.446,8996967,12.0
1,Afghanistan,AFG,Asia,1961,7.45,32.962,9169406,12.0
2,Afghanistan,AFG,Asia,1962,7.45,33.471,9351442,12.0
3,Afghanistan,AFG,Asia,1963,7.45,33.971,9543200,12.0
4,Afghanistan,AFG,Asia,1964,7.45,34.463,9744772,12.0

## Skritulio spalva Gapminder diagramoje

In [61]:

COLOR = {
    "Asia": "#e03c31",
    "Africa": "#f7ea48", 
    "Europe":  "#ff7f11",
    "North America": "#2dc84d",
    "South America": "#147bd1",
    "Oceania": "#753bbd"
}


df_gapminder["Circle Color"] = [COLOR[continent] for continent in df_gapminder["Continent"]]

df_gapminder.head()

,Country Name,Country Code,Continent,Year,Fertility,Life Expectancy,Population,Circle Size,Circle Color
0,Afghanistan,AFG,Asia,1960,7.45,32.446,8996967,12.0,#e03c31
1,Afghanistan,AFG,Asia,1961,7.45,32.962,9169406,12.0,#e03c31
2,Afghanistan,AFG,Asia,1962,7.45,33.471,9351442,12.0,#e03c31
3,Afghanistan,AFG,Asia,1963,7.45,33.971,9543200,12.0,#e03c31
4,Afghanistan,AFG,Asia,1964,7.45,34.463,9744772,12.0,#e03c31

## Gapminder vizualizacijos duomenų išsaugojimas

In [62]:
# Saving data to csv

df_gapminder.to_csv("cleaned_data/cd_gapminder.csv", index=False)